Autodesk.Revit.DB.GeometryCreationUtilities.CreateBlendGeometry(Autodesk.Revit.DB.CurveLoop,Autodesk.Revit.DB.CurveLoop,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.VertexPair},Autodesk.Revit.DB.SolidOptions)
Creates a solid by blending two closed curve loops lying in non-coincident planes.
firstLoop:
The first curve loop. The loop must be a closed planar loop without intersections or degeneracies. No orientation conditions are imposed.
secondLoop:
The second curve loop, which also must be a closed planar loop without intersections or degeneracies.
The planes of the first and second loops must not be coincident, but they need not be parallel.
vertexPairs:
This input specifies how the two profile loops should be connected.
If null, the function chooses vertex connections that will result in a geometrically reasonable blend.
solidOptions:
The optional information to control the properties of the Solid.
Returns:
The requested solid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The first profile CurveLoop do not satisfy the input requirements.
-or-
The second profile CurveLoop do not satisfy the input requirements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.GeometryCreationUtilities.CreateSweptBlendGeometry(Autodesk.Revit.DB.Curve,System.Collections.Generic.IList`1{System.Double},System.Collections.Generic.IList`1{Autodesk.Revit.DB.CurveLoop},System.Collections.Generic.IList`1{System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.VertexPair}},Autodesk.Revit.DB.SolidOptions)
Creates a solid by simultaneously sweeping and blending two or more closed planar curve loops along a single curve.
pathCurve:
The sweep path, consisting of a single bounded, open curve.
pathParams:
An increasing sequence of parameters along the path curve (lying within the curve's bounds).
These parameters specify the locations of the planes orthogonal to the path that contain the profile loops.
This array must have the same size as the input array "profileLoops".
profileLoops:
Closed, planar curve loops arrayed along the path.
The solid will have these profiles as cross-sections at the points specified by the input pathParams. The solid will blend smoothly between the profiles.
This array must have the same size as the input array "pathParams", and each profile loop must lie in the plane orthogonal to the path at the point specified by the corresponding entry in the input array "pathParams".
Each profile loop must define a single planar domain and must be free of intersections and degeneracies. No orientation conditions on the loops are imposed.
vertexPairs:
This input specifies how adjacent profile loops should be connected.
It must contain one less element than the "profileLoops" input, and entry vertexPairs[idx] specifies how profileLoops[idx] and profileLoops[idx+1] should be connected (indexing starts at 0).
solidOptions:
The optional information to control the properties of the Solid.
Returns:
The requested solid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input pathCurve is a helical curve and is not supported for this operation.
-or-
The input argument pathCurve should be bounded.
The input argument pathCurve should be non-degenerate.
-or-
The input argument pathParams should be an increasing array.
-or-
The profile CurveLoops do not satisfy the input requirements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.GeometryCreationUtilities.CreateSweptGeometry(Autodesk.Revit.DB.CurveLoop,System.Int32,System.Double,System.Collections.Generic.IList`1{Autodesk.Revit.DB.CurveLoop},Autodesk.Revit.DB.SolidOptions)
Creates a solid by sweeping one or more closed coplanar curve loops along a path.
Remarks:
The profile loops must lie in a plane orthogonal to the sweep path at some attachment point along the path.
sweepPath:
The sweep path, consisting of a set of contiguous curves. The path may be open or closed,
but should not otherwise have any self-intersections. The path may be planar or non-planar.
pathAttachmentCrvIdx:
The index of the curve in the sweep path where the profile loops are situated.
Indexing starts at 0. Together with pathAttachmentParam, this specifies the profile's attachment point.
pathAttachmentParam:
Parameter of the path curve specified by pathAttachmentCrvIdx.
The profile curves must lie in the plane orthogonal to the path at this attachment point.
profileLoops:
The curve loops defining the planar domain to be swept along the path.
No conditions are imposed on the orientations of the loops:
this function will use copies of the input loops that have been oriented as necessary to conform to Revit's orientation conventions.
Restrictions:
- The loops must lie in the plane orthogonal to the path at the attachment point as defined above.  - The curve loop(s) must be closed and should define a single planar domain (one outer loop and, optionally, one or more inner loops)  - The curve loops must be without intersections, self-intersections, or degeneracies.
solidOptions:
The optional information to control the properties of the Solid.
Returns:
The requested solid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input argument sweepPath should at least contain one curve.
-or-
The input argument pathAttachmentCrvIdx is not valid.
The given attachment point doesn't lie in the plane of the Curve Loop.
-or-
The profile CurveLoops do not satisfy the input requirements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.GeometryCreationUtilities.CreateRevolvedGeometry(Autodesk.Revit.DB.Frame,System.Collections.Generic.IList`1{Autodesk.Revit.DB.CurveLoop},System.Double,System.Double,Autodesk.Revit.DB.SolidOptions)
Creates a solid of revolution by revolving a set of closed curve loops around an axis by a specified angle.
coordinateFrame:
A right-handed orthonormal frame of vectors. The frame's z-vector is the axis of revolution. The start and end angle inputs refer to this frame.
profileLoops:
The profile loops to be revolved. No conditions are imposed on the orientations of the loops.
This function will use copies of the input loops that have been oriented as necessary to conform to Revit's orientation conventions.
Restrictions:
- The loops must lie in the xz coordinate plane of the input coordinate frame.  - The curve loop(s) must be closed and must define a single planar domain (one outer loop and, optionally, one or more inner loops).  - The curve loops must be without intersections, self-intersections, or degeneracies.  - The loops must lie on the "right" side of the z axis (where x >= 0).
startAngle:
The start angle for the revolution, in radians,
measured counter-clockwise from the coordinate frame's x-axis as viewed looking down the frame's z-axis.
endAngle:
The end angle for the revolution, using the same conventions as the start angle.
The end angle may be less than (but not equal to) the start angle.
The total angle of revolution, equal to the absolute value of (endAngle – startAngle), must be at most 2*PI.
solidOptions:
The optional information to control the properties of the Solid.
Returns:
The requested solid. Note that if less than a full revolution is used, planar end faces will be added as part of the solid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input argument coordinateFrame should be a right-handed orthonormal frame of vectors.
-or-
The profile CurveLoops do not satisfy the input requirements.
-or-
The absolute value of %(endAngle – startAngle)%, must be at most 2*PI.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.GeometryCreationUtilities.CreateExtrusionGeometry(System.Collections.Generic.IList`1{Autodesk.Revit.DB.CurveLoop},Autodesk.Revit.DB.XYZ,System.Double,Autodesk.Revit.DB.SolidOptions)
Creates a solid by linearly extruding one or more closed coplanar curve loops.
profileLoops:
The profile loops to be extruded. The loops must be closed, coplanar, and without intersections, self-intersections, or degeneracies.
No conditions are imposed on the orientations of the loops: this function will use copies of the input loops that have been oriented as necessary to conform to Revit's orientation conventions.
extrusionDir:
The direction in which to extrude the profile loops. This vector must be non-zero and transverse
(i.e., not parallel) to the plane of the profile loops. Its length is irrelevant; only its direction is used.
extrusionDist:
The positive distance by which the loops are to be extruded in the direction of the input extrusionDir.
solidOptions:
The optional information to control the properties of the Solid.
Returns:
The requested solid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The profile CurveLoops do not satisfy the input requirements.
-or-
The Input extrusionDir must be a non-zero vector.
The normal of the loop plane should not be perpendicular to the given extrusionDir.
-or-
The input argument extrusionDist must be positive.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.GeometryCreationUtilities.CreateBlendGeometry(Autodesk.Revit.DB.CurveLoop,Autodesk.Revit.DB.CurveLoop,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.VertexPair})
Creates a solid by blending two closed curve loops lying in non-coincident planes.
firstLoop:
The first curve loop. The loop must be a closed planar loop without intersections or degeneracies. No orientation conditions are imposed.
secondLoop:
The second curve loop, which also must be a closed planar loop without intersections or degeneracies.
The planes of the first and second loops must not be coincident, but they need not be parallel.
vertexPairs:
This input specifies how the two profile loops should be connected.
If null, the function chooses vertex connections that will result in a geometrically reasonable blend.
Returns:
The requested solid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The first profile CurveLoop do not satisfy the input requirements.
-or-
The second profile CurveLoop do not satisfy the input requirements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.GeometryCreationUtilities.CreateSweptBlendGeometry(Autodesk.Revit.DB.Curve,System.Collections.Generic.IList`1{System.Double},System.Collections.Generic.IList`1{Autodesk.Revit.DB.CurveLoop},System.Collections.Generic.IList`1{System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.VertexPair}})
Creates a solid by simultaneously sweeping and blending two or more closed planar curve loops along a single curve.
pathCurve:
The sweep path, consisting of a single bounded, open curve.
pathParams:
An increasing sequence of parameters along the path curve (lying within the curve's bounds).
These parameters specify the locations of the planes orthogonal to the path that contain the profile loops.
This array must have the same size as the input array "profileLoops".
profileLoops:
Closed, planar curve loops arrayed along the path.
The solid will have these profiles as cross-sections at the points specified by the input pathParams. The solid will blend smoothly between the profiles.
This array must have the same size as the input array "pathParams", and each profile loop must lie in the plane orthogonal to the path at the point specified by the corresponding entry in the input array "pathParams".
Each profile loop must define a single planar domain and must be free of intersections and degeneracies. No orientation conditions on the loops are imposed.
vertexPairs:
This input specifies how adjacent profile loops should be connected.
It must contain one less element than the "profileLoops" input, and entry vertexPairs[idx] specifies how profileLoops[idx] and profileLoops[idx+1] should be connected (indexing starts at 0).
Returns:
The requested solid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input pathCurve is a helical curve and is not supported for this operation.
-or-
The input argument pathCurve should be bounded.
The input argument pathCurve should be non-degenerate.
-or-
The input argument pathParams should be an increasing array.
-or-
The profile CurveLoops do not satisfy the input requirements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.GeometryCreationUtilities.CreateSweptGeometry(Autodesk.Revit.DB.CurveLoop,System.Int32,System.Double,System.Collections.Generic.IList`1{Autodesk.Revit.DB.CurveLoop})
Creates a solid by sweeping one or more closed coplanar curve loops along a path.
Remarks:
The profile loops must lie in a plane orthogonal to the sweep path at some attachment point along the path.
sweepPath:
The sweep path, consisting of a set of contiguous curves. The path may be open or closed,
but should not otherwise have any self-intersections. The path may be planar or non-planar.
pathAttachmentCrvIdx:
The index of the curve in the sweep path where the profile loops are situated.
Indexing starts at 0. Together with pathAttachmentParam, this specifies the profile's attachment point.
pathAttachmentParam:
Parameter of the path curve specified by pathAttachmentCrvIdx.
The profile curves must lie in the plane orthogonal to the path at this attachment point.
profileLoops:
The curve loops defining the planar domain to be swept along the path.
No conditions are imposed on the orientations of the loops:
this function will use copies of the input loops that have been oriented as necessary to conform to Revit's orientation conventions.
Restrictions:
- The loops must lie in the plane orthogonal to the path at the attachment point as defined above.  - The curve loop(s) must be closed and should define a single planar domain (one outer loop and, optionally, one or more inner loops)  - The curve loops must be without intersections, self-intersections, or degeneracies.
Returns:
The requested solid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input argument sweepPath should at least contain one curve.
-or-
The input argument pathAttachmentCrvIdx is not valid.
The given attachment point doesn't lie in the plane of the Curve Loop.
-or-
The profile CurveLoops do not satisfy the input requirements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.GeometryCreationUtilities.CreateRevolvedGeometry(Autodesk.Revit.DB.Frame,System.Collections.Generic.IList`1{Autodesk.Revit.DB.CurveLoop},System.Double,System.Double)
Creates a solid of revolution by revolving a set of closed curve loops around an axis by a specified angle.
coordinateFrame:
A right-handed orthonormal frame of vectors. The frame's z-vector is the axis of revolution. The start and end angle inputs refer to this frame.
profileLoops:
The profile loops to be revolved. No conditions are imposed on the orientations of the loops.
This function will use copies of the input loops that have been oriented as necessary to conform to Revit's orientation conventions.
Restrictions:
- The loops must lie in the xz coordinate plane of the input coordinate frame.  - The curve loop(s) must be closed and must define a single planar domain (one outer loop and, optionally, one or more inner loops).  - The curve loops must be without intersections, self-intersections, or degeneracies.  - The loops must lie on the "right" side of the z axis (where x >= 0).
startAngle:
The start angle for the revolution, in radians,
measured counter-clockwise from the coordinate frame's x-axis as viewed looking down the frame's z-axis.
endAngle:
The end angle for the revolution, using the same conventions as the start angle.
The end angle may be less than (but not equal to) the start angle.
The total angle of revolution, equal to the absolute value of (endAngle – startAngle), must be at most 2*PI.
Returns:
The requested solid. Note that if less than a full revolution is used, planar end faces will be added as part of the solid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input argument coordinateFrame should be a right-handed orthonormal frame of vectors.
-or-
The profile CurveLoops do not satisfy the input requirements.
-or-
The absolute value of %(endAngle – startAngle)%, must be at most 2*PI.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.GeometryCreationUtilities.CreateExtrusionGeometry(System.Collections.Generic.IList`1{Autodesk.Revit.DB.CurveLoop},Autodesk.Revit.DB.XYZ,System.Double)
Creates a solid by linearly extruding one or more closed coplanar curve loops.
profileLoops:
The profile loops to be extruded. The loops must be closed, coplanar, and without intersections, self-intersections, or degeneracies.
No conditions are imposed on the orientations of the loops: this function will use copies of the input loops that have been oriented as necessary to conform to Revit's orientation conventions.
extrusionDir:
The direction in which to extrude the profile loops. This vector must be non-zero and transverse
(i.e., not parallel) to the plane of the profile loops. Its length is irrelevant; only its direction is used.
extrusionDist:
The positive distance by which the loops are to be extruded in the direction of the input extrusionDir.
Returns:
The requested solid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The profile CurveLoops do not satisfy the input requirements.
-or-
The Input extrusionDir must be a non-zero vector.
The normal of the loop plane should not be perpendicular to the given extrusionDir.
-or-
The input argument extrusionDist must be positive.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012